#+title: TODOs
#+author: Aryadev Chavali
#+date: 2023-11-02
#+startup: noindent

* TODO Deal with TODOs
There is a large variety of TODOs about errors.  Let's fix them!
#+begin_src sh :exports results :results output verbatim replace
find -type 'f' -regex ".*\.[ch]\(pp\)?" -exec grep -nH TODO "{}" ";"
#+end_src

#+RESULTS:
: ./vm/runtime.c:228:    // TODO: Figure out a way to ensure the ordering of OP_PRINT_* is
: ./vm/runtime.c:578:// TODO: rename this to something more appropriate
: ./vm/runtime.c:625:// TODO: rename this to something more appropriate
: ./vm/runtime.c:641:// TODO: rename this to something more appropriate
: ./vm/runtime.c:655:// TODO: rename this to something more appropriate
: ./lib/heap.c:59:      // TODO: When does this fragmentation become a performance
: ./lib/base.c:19:  // TODO: is there a faster way of doing this?
: ./lib/base.c:25:  // TODO: is there a faster way of doing this?
: ./lib/base.c:32:  // TODO: is there a faster way of doing this?
